# Реализуйте выдачу случайного числа
# не использовать random.randint и вообще библиотеку random
# Можете использовать xor, биты, библиотеку time или datetime (миллисекунды или наносекунды) - для задания случайности
# Учтите, что есть диапазон: от(минимальное) и до (максимальное)
first = int(input("Введите начало диапазона для вывода числа: "))
second = int(input("Введите конец диапазона для вывода числа: "))

n = second - first
print(n)



